In [1]:
# 1050. Actors and Directors Who Cooperated At Least Three Times (Pandas)

import pandas as pd
from typing import List

def actors_and_directors(actor_director: pd.DataFrame) -> pd.DataFrame:
    cooperation_counts = actor_director.groupby(
        ['actor_id', 'director_id']
    ).size().reset_index(name='cooperation_count')

    qualified_pairs = cooperation_counts[
        cooperation_counts['cooperation_count'] >= 3
    ]

    return qualified_pairs[['actor_id', 'director_id']]

if __name__ == '__main__':
    print("--- Running Example Test for LeetCode 1050 ---")

    data = {
        'actor_id': [1, 1, 1, 1, 1, 2, 2],
        'director_id': [1, 1, 1, 2, 2, 1, 1],
        'timestamp': [0, 1, 2, 3, 4, 5, 6]
    }
    df = pd.DataFrame(data)

    print("\nInput DataFrame (ActorDirector Table):")
    print(df)

    result = actors_and_directors(df)

    print("\nResult (Pairs with >= 3 Collaborations):")
    print(result)

--- Running Example Test for LeetCode 1050 ---

Input DataFrame (ActorDirector Table):
   actor_id  director_id  timestamp
0         1            1          0
1         1            1          1
2         1            1          2
3         1            2          3
4         1            2          4
5         2            1          5
6         2            1          6

Result (Pairs with >= 3 Collaborations):
   actor_id  director_id
0         1            1

In [ ]:
# 1050. Actors and Directors Who Cooperated At Least Three Times (SQL)

SELECT
    actor_id,
    director_id
FROM
    ActorDirector
GROUP BY
    actor_id,
    director_id
HAVING
    COUNT(*) >= 3;

In [2]:
# 1667. Fix Names in a Table (Pandas)

import pandas as pd
from typing import List

def fix_names(users: pd.DataFrame) -> pd.DataFrame:
    users['name'] = users['name'].str.capitalize()

    users = users.sort_values(by='user_id', ascending=True).reset_index(drop=True)

    return users[['user_id', 'name']]

if __name__ == '__main__':
    print("--- Running Example Test for User Name Fix ---")

    # Example 1:
    data = {
        'user_id': [1, 2],
        'name': ['aLice', 'bOB']
    }
    df = pd.DataFrame(data)

    print("\nInput DataFrame (Users Table):")
    print(df)

    result = fix_names(df.copy()) # Use .copy() to avoid modifying the original data frame outside the function

    print("\nResult (Fixed Names):")
    print(result)

    # Example 2 (More complex names/ordering check):
    data_complex = {
        'user_id': [3, 1, 5, 2],
        'name': ['joHN', 'mArY', 'PeTeR', 'sAM']
    }
    df_complex = pd.DataFrame(data_complex)

    print("\nInput DataFrame (Complex Order):")
    print(df_complex)

    result_complex = fix_names(df_complex.copy())

    print("\nResult (Fixed Names and Ordered):")
    print(result_complex)

--- Running Example Test for User Name Fix ---

Input DataFrame (Users Table):
   user_id   name
0        1  aLice
1        2    bOB

Result (Fixed Names):
   user_id   name
0        1  Alice
1        2    Bob

Input DataFrame (Complex Order):
   user_id   name
0        3   joHN
1        1   mArY
2        5  PeTeR
3        2    sAM

Result (Fixed Names and Ordered):
   user_id   name
0        1   Mary
1        2    Sam
2        3   John
3        5  Peter

In [ ]:
# 1667. Fix Names in a Table (SQL)

SELECT
    user_id, CONCAT(UPPER(SUBSTR(name, 1, 1)), LOWER(SUBSTR(name, 2))) AS name
FROM
    Users
ORDER BY
    user_id;

In [3]:
# 175. Combine Two Tables (Pandas)

import pandas as pd
from typing import List

def combine_two_tables(person: pd.DataFrame, address: pd.DataFrame) -> pd.DataFrame:
    merged_df = pd.merge(
        person,
        address,
        on='personId',
        how='left'
    )

    return merged_df[['firstName', 'lastName', 'city', 'state']]

if __name__ == '__main__':
    print("--- Running Example Test for Combining Two Tables (Left Join) ---")

    # Input: Person table
    person_data = {
        'personId': [1, 2],
        'lastName': ['Wang', 'Alice'],
        'firstName': ['Allen', 'Bob']
    }
    person_df = pd.DataFrame(person_data)

    # Input: Address table
    address_data = {
        'addressId': [1, 2],
        'personId': [2, 3],
        'city': ['New York City', 'Leetcode'],
        'state': ['New York', 'California']
    }
    address_df = pd.DataFrame(address_data)

    print("\nInput DataFrame (Person Table):")
    print(person_df)

    print("\nInput DataFrame (Address Table):")
    print(address_df)

    result = combine_two_tables(person_df.copy(), address_df.copy())

    print("\nResult (First Name, Last Name, City, State):")
    print(result)

--- Running Example Test for Combining Two Tables (Left Join) ---

Input DataFrame (Person Table):
   personId lastName firstName
0         1     Wang     Allen
1         2    Alice       Bob

Input DataFrame (Address Table):
   addressId  personId           city       state
0          1         2  New York City    New York
1          2         3       Leetcode  California

Result (First Name, Last Name, City, State):
  firstName lastName           city     state
0     Allen     Wang            NaN       NaN
1       Bob    Alice  New York City  New York

In [ ]:
# 175. Combine Two Tables (SQL)

SELECT
    P.firstName,
    P.lastName,
    A.city,
    A.state
FROM
    Person P
LEFT JOIN
    Address A ON P.personId = A.personId;

In [6]:
# 176. Second Highest Salary (Pandas)

import pandas as pd
from typing import List

def second_highest_salary(employee: pd.DataFrame) -> pd.DataFrame:
    distinct_salaries = employee['salary'].drop_duplicates().sort_values(ascending=False)

    if len(distinct_salaries) < 2:
        second_highest = None
    else:
        second_highest = distinct_salaries.iloc[1]

    result_df = pd.DataFrame(
        {'SecondHighestSalary': [second_highest]}
    )

    return result_df

if __name__ == '__main__':
    print("--- Example 1 ---")
    data1 = [[1, 100], [2, 200], [3, 300]]
    employee_df1 = pd.DataFrame(data1, columns=['id', 'salary'])
    print("Input Employee Table (Example 1):")
    print(employee_df1.to_markdown(index=False))

    output_df1 = second_highest_salary(employee_df1)
    print("\nOutput (Example 1):")
    print(output_df1.to_markdown(index=False))

--- Example 1 ---
Input Employee Table (Example 1):
|   id |   salary |
|-----:|---------:|
|    1 |      100 |
|    2 |      200 |
|    3 |      300 |

Output (Example 1):
|   SecondHighestSalary |
|----------------------:|
|                   200 |

In [ ]:
# 176. Second Highest Salary (SQL)

SELECT
    (SELECT DISTINCT Salary
     FROM Employee
     ORDER BY Salary DESC
     LIMIT 1 OFFSET 1) AS SecondHighestSalary;